# Используем базовый образ на Python 3.11
FROM python:3.11-slim

# Указываем, куда устанавливать временные файлы для сборки Rust
ENV CARGO_HOME=/tmp/cargo

# Переключаем рабочую директорию внутрь контейнера
WORKDIR /app

# Копируем файл с зависимостями отдельно для кэширования установки
COPY requirements.txt .

# Обновляем pip и устанавливаем зависимости
RUN pip install --upgrade pip && \
    pip install -r requirements.txt

# Копируем весь остальной код проекта
COPY . .

# Определяем команду для запуска вашего бота (замените 'bot.py' на имя основного файла)
CMD ["python", "bot.py"]
